marcosdarioaranda/LPC1769/Entrada_Salida/src/entrada.c
/*
 * pulsadores.c
 *
 *  Created on: 18/11/2015
 *      Author: MarcosDario
 */

#ifdef __USE_CMSIS
#include "LPC17xx.h"
#endif
//#define __USE_CMSIS
#include "entrada.h"

void Init_Port_Entrada(int puerto, int pin)
{

    switch(puerto)
        {
            case  0: LPC_GPIO0->FIODIR &=~(1<<pin);
					break;
            case  1: LPC_GPIO1->FIODIR &=~(1<<pin);
					break;
            case  2: LPC_GPIO2->FIODIR &=~(1<<pin);
					break;
            case  3: LPC_GPIO3->FIODIR &=~(1<<pin);
					break;
            case  4: LPC_GPIO4->FIODIR &=~(1<<pin);
					break;
            default:
            		break;
	    }



}

uint32_t Estado_Pulsador(int puerto,int pin)	//Indaga si un pin de un puerto esta en alto nivel.
{
	switch(puerto)
	{
		case  0: return((LPC_GPIO0->FIOPIN & (0X1<<pin))== 0);
				 break;
        case  1: return((LPC_GPIO1->FIOPIN & (0X1<<pin))== 0);
                 break;
        case  2: return((LPC_GPIO2->FIOPIN & (0X1<<pin))== 0);
	             break;
        case  3: return((LPC_GPIO3->FIOPIN & (0X1<<pin))== 0);
		         break;
        case  4: return((LPC_GPIO4->FIOPIN & (0X1<<pin))== 0);
		         break;
        default:
	             break;
	}
}
void Enviar_Dato_Puerto(int puerto,unsigned int dato) //Pone en alto el nivel de salida de un pin.
{
	switch(puerto)
	{
        case  0: LPC_GPIO0->FIOPIN = dato;
			     break;
	    case  1: LPC_GPIO1->FIOPIN = dato;
			     break;
	    case  2: LPC_GPIO2->FIOPIN = dato;
				 break;
	    case  3: LPC_GPIO3->FIOPIN = dato;
				 break;
	    case  4: LPC_GPIO4->FIOPIN = dato;
				 break;
	    default:
	    	     break;
	  }
}


